Revit 2027 API
FabricationConfigurationInfo Methods
The FabricationConfigurationInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
FindSourceFabricationConfiguration |  Finds the source fabrication configuration on disk which matches the input fabrication configuration.
GetAllFabricationConfigurations |  Gets all added fabrication configurations.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetProfiles |  Return the profiles in the fabrication configuration.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValid |  Checks if the fabrication configuration is valid.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace